tutorial-src/tutorial/looping.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-11 Wed 21:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Looping Around</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Howard Abrams" />

   <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
   <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Looping Around</h1>
<p>
In our previous lesson, we put the value <code>1</code> and <code>2</code> into memory
location <code>129</code> in order to have the first light show different
colors. What if we wanted to go through all the possible numbers so
that we can step through all values to see what colors will show.
</p>

<p>
I suppose we <i>could</i> do something like:
</p>

<pre class="example">
SET 129 1
SET 129 2
SET 129 3
</pre>

<p>
But this is too much typing. We need a way to add one to the value.
Doing math requires a <i>register</i>. Remember the monkey who could think
of one thing at a time? Well, what the monkey can remember is called a
<i>register</i>.
</p>

<p>
Our monkey, er&#x2026; computer, is very smart. It can remember <i>three</i>
things:
</p>

<ul class="org-ul">
<li>X Register</li>
<li>Y Register</li>
<li>Z Register</li>
</ul>

<p>
While you really only need <i>one</i> register, having more registers is easier.
</p>

<p>
Here is a description of what we want our program to do:
</p>

<ol class="org-ol">
<li>Start off with some initial value in a register</li>
<li>Put the value from the register into memory <code>129</code></li>
<li>Increment the value in the register</li>
<li>Repeat step 2&#x2026;</li>
</ol>

<p>
Here is the first three steps of our program:
</p>

<pre class="example">
LDX 0    ; Put 0 in X Register
STX #81  ; Store X in First Light
INX      ; Increment value in X
</pre>

<p>
You may be wondering about all the words following the semicolons.
Those are <i>comments</i>, and let us leave notes for ourselves. The
simulator ignores all words following a semicolon, so we can write
anything we want.
</p>

<p>
The <code>LDX</code> looks at the next value, and puts that in the X Register.
When we <b>Load</b> our program, the <b>X Register</b> is already set to 0, but
this isn't always the case with computers, so we generally want to set
our values when we start.
</p>

<p>
The <code>STX</code> stores the value in the X register in some memory
address. In this case, our old friend, <code>#81</code> &#x2026; the memory location
that controls the first light bulb's color.
</p>

<p>
The <code>INX</code> increments the value in the X register.
</p>

<p>
Pretty straight forward, eh? Now that the X register is incremented,
let's <i>jump</i> back in our program to where we can store the X
register's contents back into our memory location.
</p>

<p>
For this, we use the <code>JMP</code> instruction. It allows us to jump to any
point in memory by setting a new value in our <b>Pointer Register</b>.
</p>

<p>
But what is the address we want to jump to? Well, if we click the
<b>Load</b> button, we will see our program in memory:
</p>

<ol class="org-ol">
<li value="0">has a <code>2</code>, which is the instruction number for <code>LDX</code></li>
<li>has a <code>0</code>, which is the value to store in the X register</li>
<li>has a <code>6</code>, which is the instruction number for <code>STX</code></li>
<li>has a <code>129</code>, which is the memory address for the light</li>
<li>has a <code>10</code>, the instruction number for <code>INX</code></li>
</ol>

<p>
So, clearly, we need to <i>jump</i> to memory location <code>2</code>!
</p>

<p>
Here is our updated program:
</p>

<pre class="example">
LDX 0    ; Put 0 in X Register
STX #81  ; Store X Reg in Light
INX      ; Increment X Register
JMP 2    ; Loop to store X reg
</pre>

<p>
Click the <b>Load</b> and then continually click the <b>Step</b> to see if you
can figure out the pattern for what values choose the color for the
light.
</p>

<p>
By the way, jumping back to where we've already been, is called <i>looping</i>.
</p>

<p>
Our programs are getting more interesting as we learn more of the
instructions that are available. But that <code>JMP</code> feature isn't so nice.
In the next section, we'll learn how to make that easier.
</p>
</div>
</body>
</html>
